# SpecTypeId.Boolean Class

---
This class contains constants identifying Boolean specs.
SystemObject Autodesk.Revit.DBSpecTypeIdBoolean
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class Boolean

    Public NotInheritable Class Boolean

    public ref class Boolean abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type Boolean = class end
The SpecTypeIdBoolean type exposes the following members.
| Name| Description
---|---|---
| YesNo|  Yes/No, in discipline Common.
Top
#### Reference
Autodesk.Revit.DB Namespace